#+-*-mode: org;-*-
#+creator: Emacs 28.0.50 (Org mode 9.3 + ox-hugo)
#+hugo_with_locale: en
#+hugo_front_matter_format: toml
#+hugo_level_offset: 1
#+hugo_delete_trailing_ws:
#+hugo_section: post
#+hugo_bundle:
#+hugo_base_dir: ../../../
#+date: <2020-06-03 Wed>
#+hugo_tags: 
#+hugo_categories: 
#+title: Arch Linux Tips

** Generating a list of installed packages in archlinux

   #+BEGIN_SRC shell :exports code :results verbatim :cache yes
     pacman -Q -q
   #+END_SRC

   #+RESULTS[85107b1dcf1621315d4ff772d6aa2e8b9542077b]:
   #+begin_example
   a52dec
   aalib
   accounts-qml-module
   accountsservice
   acl
   adobe-source-code-pro-fonts
   adwaita-icon-theme
   akonadi
   akonadi-calendar
   akonadi-calendar-tools
   akonadi-contacts
   akonadi-import-wizard
   akonadi-mime
   akonadi-notes
   akonadi-search
   akonadiconsole
   akregator
   alsa-lib
   alsa-plugins
   alsa-topology-conf
   alsa-ucm-conf
   alsa-utils
   analitza
   aom
   appstream
   appstream-qt
   archlinux-appstream-data
   archlinux-keyring
   argon2
   aribb24
   ark
   artikulate
   at-spi2-atk
   at-spi2-core
   atk
   attica
   attr
   audiocd-kio
   audiofile
   audit
   autoconf
   autojump
   automake
   avahi
   avogadrolibs
   baloo
   baloo-widgets
   base
   bash
   bat
   bbswitch
   bc
   binutils
   bison
   black-hole-solver
   blinken
   bluedevil
   bluez
   bluez-libs
   bluez-qt
   bolt
   bomber
   boost-libs
   botan
   bovo
   breeze
   breeze-gtk
   breeze-icons
   brotli
   btrfs-progs
   bubblewrap
   bzip2
   c-ares
   ca-certificates
   ca-certificates-mozilla
   ca-certificates-utils
   cairo
   calendarsupport
   cantarell-fonts
   cantor
   cdparanoia
   cervisia
   cfitsio
   chromaprint
   cifs-utils
   cl-alexandria-git
   cl-ppcre
   cl-zpb-ttf
   clang
   clash
   clx-git
   cmake
   colord
   compiler-rt
   convertlit
   coordgen
   coreutils
   cracklib
   cronie
   cryptsetup
   cups
   cups-filters
   curl
   dav1d
   db
   dbus
   dbus-glib
   dconf
   desktop-file-utils
   device-mapper
   dhcpcd
   dialog
   diffutils
   discount
   discover
   djvulibre
   dmraid
   dnssec-anchors
   docbook-xml
   docbook-xsl
   dolphin
   dolphin-plugins
   dosfstools
   double-conversion
   dragon
   drkonqi
   e2fsprogs
   ebook-tools
   editorconfig-core-c
   efibootmgr
   efivar
   egl-wayland
   eglexternalplatform
   elfutils
   elisa
   emacs
   eventviews
   exempi
   exiv2
   expat
   faac
   faad2
   fakeroot
   farstream
   fcitx
   fcitx-cloudpinyin
   fcitx-configtool
   fcitx-googlepinyin
   fcitx-qt5
   ffmpeg
   ffmpegthumbs
   fftw
   file
   filelight
   filesystem
   findutils
   firefox
   flac
   flex
   fluidsynth
   fontconfig
   frameworkintegration
   freecell-solver
   freetype2
   frei0r-plugins
   fribidi
   fuse-common
   fuse2
   fuse3
   gavl
   gawk
   gc
   gcc
   gcc-libs
   gcr
   gd
   gdb
   gdb-common
   gdbm
   gdk-pixbuf2
   gettext
   gflags
   ghostscript
   giflib
   git
   glew
   glib-networking
   glib2
   glibc
   glslang
   glu
   gmp
   gnome-autoar
   gnome-desktop
   gnu-free-fonts
   gnugo
   gnupg
   gnutls
   go
   google-chrome
   gperf
   gpgme
   gpm
   gptfdisk
   granatier
   grantlee
   grantlee-editor
   grantleetheme
   graphene
   graphite
   grep
   groff
   grpc
   grpc-cli
   grub
   grub-theme-vimix
   gsettings-desktop-schemas
   gsl
   gsm
   gssdp
   gst-plugins-bad
   gst-plugins-bad-libs
   gst-plugins-base
   gst-plugins-base-libs
   gst-plugins-good
   gstreamer
   gtk-update-icon-cache
   gtk2
   gtk3
   guile
   guile2.0
   gupnp
   gupnp-dlna
   gupnp-igd
   gvfs
   gwenview
   gzip
   harfbuzz
   hdf5
   hicolor-icon-theme
   http-parser
   hugo
   hunspell
   hwids
   hwloc
   hyphen
   iana-etc
   icu
   id3lib
   ijs
   imagemagick
   imlib2
   incidenceeditor
   inetutils
   iproute2
   iptables
   iputils
   iso-codes
   iw
   jack
   jansson
   jasper
   jbig2dec
   jemalloc
   jq
   js60
   json-c
   json-glib
   jsoncpp
   juk
   k3b
   kaccounts-integration
   kaccounts-providers
   kactivities
   kactivities-stats
   kactivitymanagerd
   kaddressbook
   kajongg
   kalarm
   kalarmcal
   kalgebra
   kalzium
   kamera
   kamoso
   kanagram
   kapman
   kapptemplate
   karchive
   kate
   katomic
   kauth
   kbackup
   kbd
   kblackbox
   kblocks
   kbookmarks
   kbounce
   kbreakout
   kbruch
   kcachegrind
   kcachegrind-common
   kcalc
   kcalendarcore
   kcalutils
   kcharselect
   kcm-fcitx
   kcmutils
   kcodecs
   kcolorchooser
   kcompletion
   kconfig
   kconfigwidgets
   kcontacts
   kcoreaddons
   kcrash
   kcron
   kdav
   kdbusaddons
   kde-cli-tools
   kde-dev-scripts
   kde-dev-utils
   kde-gtk-config
   kdebugsettings
   kdeclarative
   kdeconnect
   kdecoration
   kded
   kdeedu-data
   kdegraphics-mobipocket
   kdegraphics-thumbnailers
   kdelibs4support
   kdenetwork-filesharing
   kdenlive
   kdepim-addons
   kdepim-apps-libs
   kdepim-runtime
   kdeplasma-addons
   kdesdk-kioslaves
   kdesdk-thumbnailers
   kdesu
   kdevelop
   kdf
   kdiagram
   kdialog
   kdiamond
   kdnssd
   kdoctools
   kdsoap
   kdsoap-ws-discovery-client
   keditbookmarks
   kemoticons
   keyutils
   kfilemetadata
   kfind
   kfloppy
   kfourinline
   kgamma5
   kgeography
   kget
   kglobalaccel
   kgoldrunner
   kgpg
   kguiaddons
   khangman
   khelpcenter
   kholidays
   khotkeys
   khtml
   ki18n
   kiconthemes
   kidentitymanagement
   kidletime
   kig
   kigo
   killbots
   kimagemapeditor
   kimap
   kinfocenter
   kinit
   kio
   kio-extras
   kipi-plugins
   kirigami-gallery
   kirigami2
   kiriki
   kitemmodels
   kitemviews
   kiten
   kitinerary
   kjobwidgets
   kjs
   kjumpingcube
   kldap
   kleopatra
   klettres
   klickety
   klines
   kmag
   kmahjongg
   kmail
   kmail-account-wizard
   kmailtransport
   kmbox
   kmenuedit
   kmime
   kmines
   kmix
   kmod
   kmousetool
   kmouth
   kmplot
   knavalbattle
   knetattach
   knetwalk
   knewstuff
   knights
   knotes
   knotifications
   knotifyconfig
   kolf
   kollision
   kolourpaint
   kompare
   konqueror
   konquest
   konsole
   kontact
   kontactinterface
   kopete
   korganizer
   kpackage
   kparts
   kpatience
   kpeople
   kpeoplevcard
   kpimtextedit
   kpkpass
   kplotting
   kpty
   kqtquickcharts
   kquickcharts
   krb5
   krdc
   kreversi
   krfb
   kross
   kross-interpreters
   kruler
   krunner
   kscreen
   kscreenlocker
   kservice
   kshisen
   ksirk
   ksmtp
   ksnakeduel
   kspaceduel
   ksquares
   ksshaskpass
   ksudoku
   ksysguard
   ksystemlog
   kteatime
   ktexteditor
   ktextwidgets
   ktimer
   ktnef
   ktouch
   ktuberling
   kturtle
   kubrick
   kunitconversion
   kuserfeedback
   kwallet
   kwallet-pam
   kwalletmanager
   kwave
   kwayland
   kwayland-integration
   kwidgetsaddons
   kwin
   kwindowsystem
   kwordquiz
   kwrite
   kwrited
   kxmlgui
   l-smash
   lame
   lcms2
   ldb
   ldns
   less
   libaccounts-glib
   libaccounts-qt
   libaec
   libaio
   libakonadi
   libarchive
   libass
   libassuan
   libasyncns
   libatasmart
   libavc1394
   libblockdev
   libbluray
   libbs2b
   libbsd
   libburn
   libbytesize
   libcaca
   libcanberra
   libcanberra-pulse
   libcap
   libcap-ng
   libcddb
   libcdio
   libcdio-paranoia
   libcroco
   libcue
   libcups
   libdaemon
   libdatrie
   libdbusmenu-qt5
   libdc1394
   libdca
   libde265
   libdmtx
   libdrm
   libdv
   libdvbpsi
   libdvdnav
   libdvdread
   libebml
   libebur128
   libedit
   libelf
   libepoxy
   libevdev
   libevent
   libexif
   libfakekey
   libfbclient
   libfdk-aac
   libffi
   libfontenc
   libgcrypt
   libgexiv2
   libgit2
   libglvnd
   libgme
   libgooglepinyin
   libgpg-error
   libgphoto2
   libgravatar
   libgrss
   libgsf
   libgudev
   libgusb
   libgxps
   libibus
   libical
   libice
   libid3tag
   libidn
   libidn11
   libidn2
   libiec61883
   libieee1284
   libimobiledevice
   libinput
   libinstpatch
   libiptcdata
   libjpeg-turbo
   libkate
   libkcddb
   libkcompactdisc
   libkdcraw
   libkdegames
   libkdepim
   libkeduvocdocument
   libkexiv2
   libkgapi
   libkipi
   libkleo
   libkmahjongg
   libkolabxml
   libkomparediff2
   libksane
   libksba
   libkscreen
   libksieve
   libksysguard
   libldap
   liblouis
   liblqr
   liblrdf
   libmad
   libmagick6
   libmatroska
   libmbim
   libmfx
   libmicrohttpd
   libmm-glib
   libmms
   libmng
   libmnl
   libmodplug
   libmpc
   libmpcdec
   libmpeg2
   libmsym
   libmtp
   libmusicbrainz5
   libnautilus-extension
   libndp
   libnetfilter_conntrack
   libnewt
   libnfnetlink
   libnftnl
   libnghttp2
   libnice
   libnl
   libnm
   libnotify
   libnsl
   libofa
   libogg
   libomxil-bellagio
   libosinfo
   libotf
   libotr
   libp11-kit
   libpaper
   libpcap
   libpciaccess
   libpgm
   libphonenumber
   libpipeline
   libplacebo
   libplist
   libpng
   libproxy
   libpsl
   libpulse
   libpwquality
   libqaccessibilityclient
   libqalculate
   libqmi
   libqtshadowsocks
   libquvi
   libquvi-scripts
   libraqm
   libraw
   libraw1394
   librsvg
   libsamplerate
   libsasl
   libseccomp
   libsecret
   libshout
   libsignon-glib
   libsm
   libsndfile
   libsodium
   libsoup
   libsoxr
   libspectre
   libsrtp
   libssh
   libssh2
   libstemmer
   libtar
   libtasn1
   libteam
   libthai
   libtheora
   libtiff
   libtirpc
   libtommath
   libtool
   libunistring
   libunwind
   libupnp
   libusb
   libusbmuxd
   libutempter
   libutil-linux
   libuv
   libva
   libvdpau
   libvisual
   libvncserver
   libvorbis
   libvpx
   libwacom
   libwebp
   libx11
   libxau
   libxaw
   libxcb
   libxcomposite
   libxcursor
   libxdamage
   libxdmcp
   libxext
   libxfixes
   libxfont2
   libxft
   libxi
   libxinerama
   libxkbcommon
   libxkbcommon-x11
   libxkbfile
   libxml2
   libxmu
   libxpm
   libxrandr
   libxrender
   libxres
   libxshmfence
   libxslt
   libxss
   libxt
   libxtst
   libxv
   libxvmc
   libxxf86vm
   libyaml
   libzip
   licenses
   lilv
   linux
   linux-api-headers
   linux-firmware
   llvm-libs
   lm_sensors
   lmdb
   lokalize
   lsb-release
   lskat
   lua
   lua52
   lua52-bitop
   lua52-expat
   lua52-lpeg
   lua52-luajson
   lua52-socket
   lvm2
   lz4
   lzo
   m17n-db
   m17n-lib
   m4
   maeparser
   mailcap
   mailcommon
   mailimporter
   make
   man-db
   marble
   marble-common
   mariadb
   mariadb-clients
   mariadb-libs
   mbox-importer
   md4c
   mdadm
   media-player-info
   mesa
   messagelib
   milou
   minizip
   minuet
   mjpegtools
   mkinitcpio
   mkinitcpio-busybox
   mlt
   mobile-broadband-provider-info
   modemmanager
   modemmanager-qt
   molequeue
   mons
   mpfr
   mpg123
   mtdev
   nautilus
   nautilus-sendto
   ncurses
   ndctl
   neon
   net-snmp
   net-tools
   nettle
   networkmanager
   networkmanager-qt
   ninja
   node-gyp
   nodejs
   noto-fonts
   npm
   npth
   nspr
   nss
   ntfs-3g
   nvidia
   nvidia-utils
   nvidia-xrun
   okular
   oniguruma
   openal
   openbabel
   opencc
   opencore-amr
   openexr
   openjpeg2
   openmpi
   openntpd
   openssh
   openssl
   opus
   orc
   os-prober
   osinfo-db
   oxygen
   p11-kit
   pacman
   pacman-mirrorlist
   palapeli
   pam
   pambase
   pango
   parley
   parted
   patch
   pciutils
   pcre
   pcre2
   perl
   perl-error
   perl-mailtools
   perl-timedate
   phonon-qt5
   phonon-qt5-gstreamer
   picmi
   pim-data-exporter
   pim-sieve-editor
   pimcommon
   pinentry
   pipewire
   pixman
   pkgconf
   plasma-browser-integration
   plasma-desktop
   plasma-framework
   plasma-integration
   plasma-nm
   plasma-pa
   plasma-sdk
   plasma-thunderbolt
   plasma-vault
   plasma-workspace
   plasma-workspace-wallpapers
   polkit
   polkit-kde-agent
   polkit-qt5
   poppler
   poppler-glib
   poppler-qt5
   popt
   portaudio
   postgresql-libs
   powerdevil
   poxml
   ppp
   print-manager
   prison
   procps-ng
   protobuf
   proxychains-ng
   psmisc
   pulseaudio
   pulseaudio-alsa
   pulseaudio-qt
   purpose
   python
   python-appdirs
   python-attrs
   python-automat
   python-click
   python-constantly
   python-hyperlink
   python-idna
   python-incremental
   python-ordered-set
   python-packaging
   python-pyhamcrest
   python-pyparsing
   python-pyqt5
   python-pyqt5-sip
   python-setuptools
   python-six
   python-twisted
   python-zope-interface
   python2
   qca
   qgpgme
   qhull
   qpdf
   qqc2-desktop-style
   qrencode
   qt-gstreamer
   qt5-base
   qt5-declarative
   qt5-graphicaleffects
   qt5-location
   qt5-multimedia
   qt5-networkauth
   qt5-quickcontrols
   qt5-quickcontrols2
   qt5-script
   qt5-sensors
   qt5-speech
   qt5-svg
   qt5-tools
   qt5-wayland
   qt5-webchannel
   qt5-webengine
   qt5-webkit
   qt5-x11extras
   qt5-xmlpatterns
   qv2ray
   raptor
   re2
   readline
   reiserfsprogs
   rest
   rhash
   rocs
   rtkit
   rtmpdump
   rttr
   ruby
   ruby-irb
   ruby-reline
   rubygems
   run-parts
   sane
   sbc
   sbcl
   sddm
   sddm-kcm
   sdl
   sdl2
   sed
   semver
   serd
   shaderc
   shadow
   shadowsocks-qt5
   shared-mime-info
   shc
   signon-kwallet-extension
   signon-plugin-oauth2
   signon-ui
   signond
   slang
   smbclient
   snappy
   socat
   solid
   sonnet
   sord
   sound-theme-freedesktop
   soundtouch
   source-highlight
   spandsp
   spectacle
   speex
   speexdsp
   spglib
   spirv-tools
   sqlite
   sratom
   srt
   startup-notification
   step
   stumpwm
   sudo
   surfraw
   sweeper
   syndication
   syntax-highlighting
   sysfsutils
   systemd
   systemd-libs
   systemd-sysvcompat
   systemsettings
   taglib
   talloc
   tar
   tcsh
   tdb
   telepathy-accounts-signon
   telepathy-farstream
   telepathy-glib
   telepathy-kde-accounts-kcm
   telepathy-kde-approver
   telepathy-kde-auth-handler
   telepathy-kde-call-ui
   telepathy-kde-common-internals
   telepathy-kde-contact-list
   telepathy-kde-contact-runner
   telepathy-kde-desktop-applets
   telepathy-kde-filetransfer-handler
   telepathy-kde-integration-module
   telepathy-kde-send-file
   telepathy-kde-text-ui
   telepathy-logger
   telepathy-logger-qt
   telepathy-mission-control
   telepathy-qt
   tevent
   texinfo
   thin-provisioning-tools
   threadweaver
   tor
   totem-pl-parser
   tracker
   tracker-miners
   trash-cli
   tree
   tslib
   ttf-hack
   ttf-iosevka-term
   twolame
   tzdata
   udisks2
   umbrello
   unixodbc
   unzip
   upower
   usbmuxd
   user-manager
   util-linux
   v2ray
   v2ray-domain-list-community
   v2ray-geoip
   v4l-utils
   vi
   vid.stab
   vim
   vim-runtime
   vlc
   vmaf
   volume_key
   vtk
   vulkan-icd-loader
   wavpack
   wayland
   wayland-protocols
   webrtc-audio-processing
   wget
   which
   wildmidi
   woff2
   wpa_supplicant
   wqy-bitmapfont
   wqy-microhei
   wqy-microhei-lite
   wqy-zenhei
   x264
   x265
   xapian-core
   xbitmaps
   xcb-proto
   xcb-util
   xcb-util-cursor
   xcb-util-image
   xcb-util-keysyms
   xcb-util-renderutil
   xcb-util-wm
   xdg-desktop-portal-kde
   xdg-utils
   xerces-c
   xf86-input-libinput
   xf86-video-intel
   xf86-video-vesa
   xfsprogs
   xgetres
   xkeyboard-config
   xorg-bdftopcf
   xorg-docs
   xorg-font-util
   xorg-font-utils
   xorg-fonts-100dpi
   xorg-fonts-75dpi
   xorg-fonts-alias
   xorg-fonts-cyrillic
   xorg-fonts-encodings
   xorg-fonts-misc
   xorg-fonts-type1
   xorg-iceauth
   xorg-luit
   xorg-mkfontscale
   xorg-server
   xorg-server-common
   xorg-server-devel
   xorg-server-xephyr
   xorg-server-xnest
   xorg-server-xvfb
   xorg-server-xwayland
   xorg-sessreg
   xorg-setxkbmap
   xorg-smproxy
   xorg-util-macros
   xorg-x11perf
   xorg-xauth
   xorg-xbacklight
   xorg-xcmsdb
   xorg-xcursorgen
   xorg-xdpyinfo
   xorg-xdriinfo
   xorg-xev
   xorg-xgamma
   xorg-xhost
   xorg-xinit
   xorg-xinput
   xorg-xkbcomp
   xorg-xkbevd
   xorg-xkbutils
   xorg-xkill
   xorg-xload
   xorg-xlsatoms
   xorg-xlsclients
   xorg-xmessage
   xorg-xmodmap
   xorg-xpr
   xorg-xprop
   xorg-xrandr
   xorg-xrdb
   xorg-xrefresh
   xorg-xset
   xorg-xsetroot
   xorg-xvinfo
   xorg-xwd
   xorg-xwininfo
   xorg-xwud
   xorgproto
   xterm
   xvidcore
   xz
   yakuake
   yay
   zbar
   zeroconf-ioslave
   zeromq
   zita-alsa-pcmi
   zita-resampler
   zlib
   zsh
   zstd
   zvbi
   zxing-cpp
   #+end_example

